program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3402.3.2"}, {"coremlc-version", "3402.4.1"}})]
{
    func main<ios16>(tensor<int32, [?]> context) [FlexibleShapeInformation = tuple<tuple<tensor<string, []>, dict<tensor<string, []>, tensor<int32, [?]>>>, tuple<tensor<string, []>, dict<tensor<string, []>, list<tensor<int32, [2]>, ?>>>>((("DefaultShapes", {{"context", [1]}}), ("RangeDims", {{"context", [[1, 32]]}})))] {
            tensor<int32, []> var_6 = const()[name = tensor<string, []>("op_6"), val = tensor<int32, []>(768)];
            tensor<int32, []> var_8 = const()[name = tensor<string, []>("op_8"), val = tensor<int32, []>(64)];
            tensor<int32, []> var_9 = const()[name = tensor<string, []>("op_9"), val = tensor<int32, []>(2304)];
            tensor<int32, []> var_11 = const()[name = tensor<string, []>("op_11"), val = tensor<int32, []>(3072)];
            tensor<int32, []> var_22 = const()[name = tensor<string, []>("op_22"), val = tensor<int32, []>(1)];
            tensor<int32, []> var_23 = const()[name = tensor<string, []>("op_23"), val = tensor<int32, []>(-1)];
            tensor<int32, []> var_24 = const()[name = tensor<string, []>("op_24"), val = tensor<int32, []>(0)];
            tensor<int32, [1]> var_44_shape = shape(x = context)[name = tensor<string, []>("op_44_shape")];
            tensor<int32, []> gather_0_indices_0 = const()[name = tensor<string, []>("gather_0_indices_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_0_axis_0 = const()[name = tensor<string, []>("gather_0_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_0_batch_dims_0 = const()[name = tensor<string, []>("gather_0_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_0 = gather(axis = gather_0_axis_0, batch_dims = gather_0_batch_dims_0, indices = gather_0_indices_0, x = var_44_shape)[name = tensor<string, []>("gather_0")];
            tensor<int32, [2]> concat_0x = const()[name = tensor<string, []>("concat_0x"), val = tensor<int32, [2]>([1, -1])];
            tensor<int32, [1, ?]> input_ids = reshape(shape = concat_0x, x = context)[name = tensor<string, []>("input_ids")];
            tensor<int32, []> gather_1 = const()[name = tensor<string, []>("gather_1"), val = tensor<int32, []>(1)];
            tensor<int32, []> const_0 = const()[name = tensor<string, []>("const_0"), val = tensor<int32, []>(1)];
            tensor<int32, [?]> position_ids = range_1d(end = gather_0, start = var_24, step = const_0)[name = tensor<string, []>("position_ids")];
            tensor<int32, [1]> input_1_axes_0 = const()[name = tensor<string, []>("input_1_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<int32, [1, ?]> input_1 = expand_dims(axes = input_1_axes_0, x = position_ids)[name = tensor<string, []>("input_1")];
            tensor<int32, []> inputs_embeds_axis_0 = const()[name = tensor<string, []>("inputs_embeds_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [50257, 768]> transformer_wte_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [9649344]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64))), lut = tensor<fp16, [4]>([-0x1.cccp-3, -0x1.17p-4, 0x1.fcp-5, 0x1.b94p-3]), name = tensor<string, []>("transformer_wte_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([50257, 768])];
            tensor<int32, []> inputs_embeds_cast_fp16_batch_dims_0 = const()[name = tensor<string, []>("inputs_embeds_cast_fp16_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [1, ?, 768]> inputs_embeds_cast_fp16 = gather(axis = inputs_embeds_axis_0, batch_dims = inputs_embeds_cast_fp16_batch_dims_0, indices = input_ids, x = transformer_wte_weight_to_fp16_palettized)[name = tensor<string, []>("inputs_embeds_cast_fp16")];
            tensor<int32, []> position_embeds_axis_0 = const()[name = tensor<string, []>("position_embeds_axis_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [1024, 768]> transformer_wpe_weight_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [196608]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9649472))), lut = tensor<fp16, [4]>([-0x1.21p-1, -0x1.2ecp-9, 0x1.3d4p-2, 0x1.7d8p-1]), name = tensor<string, []>("transformer_wpe_weight_to_fp16_palettized"), shape = tensor<uint32, [2]>([1024, 768])];
            tensor<int32, []> position_embeds_cast_fp16_batch_dims_0 = const()[name = tensor<string, []>("position_embeds_cast_fp16_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<fp16, [1, ?, 768]> position_embeds_cast_fp16 = gather(axis = position_embeds_axis_0, batch_dims = position_embeds_cast_fp16_batch_dims_0, indices = input_1, x = transformer_wpe_weight_to_fp16_palettized)[name = tensor<string, []>("position_embeds_cast_fp16")];
            tensor<fp16, [1, ?, 768]> input_3_cast_fp16 = add(x = inputs_embeds_cast_fp16, y = position_embeds_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<int32, []> past_key_values_length = sub(x = gather_0, y = gather_0)[name = tensor<string, []>("past_key_values_length")];
            tensor<int32, []> concat_1_axis_0 = const()[name = tensor<string, []>("concat_1_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_1_interleave_0 = const()[name = tensor<string, []>("concat_1_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [2]> concat_1 = concat(axis = concat_1_axis_0, interleave = concat_1_interleave_0, values = (gather_0, gather_0))[name = tensor<string, []>("concat_1")];
            tensor<fp16, []> mask_1_value_0_to_fp16 = const()[name = tensor<string, []>("mask_1_value_0_to_fp16"), val = tensor<fp16, []>(-inf)];
            tensor<fp16, [?, ?]> mask_1_cast_fp16 = fill(shape = concat_1, value = mask_1_value_0_to_fp16)[name = tensor<string, []>("mask_1_cast_fp16")];
            tensor<int32, [2]> var_64_shape_cast_fp16 = shape(x = mask_1_cast_fp16)[name = tensor<string, []>("op_64_shape_cast_fp16")];
            tensor<int32, []> gather_2_indices_0 = const()[name = tensor<string, []>("gather_2_indices_0"), val = tensor<int32, []>(-1)];
            tensor<int32, []> gather_2_axis_0 = const()[name = tensor<string, []>("gather_2_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_2_batch_dims_0 = const()[name = tensor<string, []>("gather_2_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_2 = gather(axis = gather_2_axis_0, batch_dims = gather_2_batch_dims_0, indices = gather_2_indices_0, x = var_64_shape_cast_fp16)[name = tensor<string, []>("gather_2")];
            tensor<int32, []> const_1 = const()[name = tensor<string, []>("const_1"), val = tensor<int32, []>(0)];
            tensor<int32, []> const_2 = const()[name = tensor<string, []>("const_2"), val = tensor<int32, []>(1)];
            tensor<int32, [?]> mask_cond = range_1d(end = gather_2, start = const_1, step = const_2)[name = tensor<string, []>("mask_cond")];
            tensor<int32, []> var_66 = const()[name = tensor<string, []>("op_66"), val = tensor<int32, []>(1)];
            tensor<int32, [?]> var_67 = add(x = mask_cond, y = var_66)[name = tensor<string, []>("op_67")];
            tensor<int32, [2]> concat_2x = const()[name = tensor<string, []>("concat_2x"), val = tensor<int32, [2]>([-1, 1])];
            tensor<int32, [?, 1]> var_70 = reshape(shape = concat_2x, x = var_67)[name = tensor<string, []>("op_70")];
            tensor<bool, [?, ?]> var_71 = less(x = mask_cond, y = var_70)[name = tensor<string, []>("op_71")];
            tensor<fp16, []> cast_4_to_fp16 = const()[name = tensor<string, []>("cast_4_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [?, ?]> mask_3_cast_fp16 = select(a = cast_4_to_fp16, b = mask_1_cast_fp16, cond = var_71)[name = tensor<string, []>("mask_3_cast_fp16")];
            tensor<int32, [1]> var_74_axes_0 = const()[name = tensor<string, []>("op_74_axes_0"), val = tensor<int32, [1]>([0])];
            tensor<fp16, [1, ?, ?]> var_74_cast_fp16 = expand_dims(axes = var_74_axes_0, x = mask_3_cast_fp16)[name = tensor<string, []>("op_74_cast_fp16")];
            tensor<int32, [1]> var_75_axes_0 = const()[name = tensor<string, []>("op_75_axes_0"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, ?, ?]> var_75_cast_fp16 = expand_dims(axes = var_75_axes_0, x = var_74_cast_fp16)[name = tensor<string, []>("op_75_cast_fp16")];
            tensor<int32, []> var_78 = add(x = gather_0, y = past_key_values_length)[name = tensor<string, []>("op_78")];
            tensor<int32, []> concat_3_axis_0 = const()[name = tensor<string, []>("concat_3_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_3_interleave_0 = const()[name = tensor<string, []>("concat_3_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> concat_3 = concat(axis = concat_3_axis_0, interleave = concat_3_interleave_0, values = (gather_1, var_22, gather_0, var_78))[name = tensor<string, []>("concat_3")];
            tensor<int32, [4]> shape_0_cast_fp16 = shape(x = var_75_cast_fp16)[name = tensor<string, []>("shape_0_cast_fp16")];
            tensor<int32, [4]> real_div_0 = real_div(x = concat_3, y = shape_0_cast_fp16)[name = tensor<string, []>("real_div_0")];
            tensor<fp16, [?, ?, ?, ?]> attention_mask_cast_fp16 = tile(reps = real_div_0, x = var_75_cast_fp16)[name = tensor<string, []>("attention_mask_cast_fp16")];
            tensor<int32, [1]> x_1_axes_0 = const()[name = tensor<string, []>("x_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> transformer_h_0_ln_1_weight_to_fp16 = const()[name = tensor<string, []>("transformer_h_0_ln_1_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9846144)))];
            tensor<fp16, [768]> transformer_h_0_ln_1_bias_to_fp16 = const()[name = tensor<string, []>("transformer_h_0_ln_1_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9847744)))];
            tensor<fp16, []> var_5_to_fp16 = const()[name = tensor<string, []>("op_5_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, ?, 768]> x_1_cast_fp16 = layer_norm(axes = x_1_axes_0, beta = transformer_h_0_ln_1_bias_to_fp16, epsilon = var_5_to_fp16, gamma = transformer_h_0_ln_1_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("x_1_cast_fp16")];
            tensor<int32, [2]> var_99 = const()[name = tensor<string, []>("op_99"), val = tensor<int32, [2]>([-1, 768])];
            tensor<fp16, [?, 768]> var_100_cast_fp16 = reshape(shape = var_99, x = x_1_cast_fp16)[name = tensor<string, []>("op_100_cast_fp16")];
            tensor<fp16, [2304, 768]> transpose_0_cast_fp16_to_fp32_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [442368]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9849344))), lut = tensor<fp16, [4]>([-0x1.81cp-2, -0x1.2c8p-4, 0x1.4p-4, 0x1.864p-2]), name = tensor<string, []>("transpose_0_cast_fp16_to_fp32_to_fp16_palettized"), shape = tensor<uint32, [2]>([2304, 768])];
            tensor<fp16, [2304]> x_3_bias_0_to_fp16 = const()[name = tensor<string, []>("x_3_bias_0_to_fp16"), val = tensor<fp16, [2304]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10291776)))];
            tensor<fp16, [?, 2304]> x_3_cast_fp16 = linear(bias = x_3_bias_0_to_fp16, weight = transpose_0_cast_fp16_to_fp32_to_fp16_palettized, x = var_100_cast_fp16)[name = tensor<string, []>("x_3_cast_fp16")];
            tensor<int32, [3]> concat_4x = const()[name = tensor<string, []>("concat_4x"), val = tensor<int32, [3]>([1, -1, 2304])];
            tensor<fp16, [1, ?, 2304]> var_103_cast_fp16 = reshape(shape = concat_4x, x = x_3_cast_fp16)[name = tensor<string, []>("op_103_cast_fp16")];
            tensor<int32, [3]> tile_0 = const()[name = tensor<string, []>("tile_0"), val = tensor<int32, [3]>([768, 768, 768])];
            tensor<int32, []> var_104_axis_0 = const()[name = tensor<string, []>("op_104_axis_0"), val = tensor<int32, []>(2)];
            tensor<fp16, [1, ?, 768]> var_104_cast_fp16_0, tensor<fp16, [1, ?, 768]> var_104_cast_fp16_1, tensor<fp16, [1, ?, 768]> var_104_cast_fp16_2 = split(axis = var_104_axis_0, split_sizes = tile_0, x = var_103_cast_fp16)[name = tensor<string, []>("op_104_cast_fp16")];
            tensor<int32, [4]> concat_5x = const()[name = tensor<string, []>("concat_5x"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, ?, 12, 64]> var_113_cast_fp16 = reshape(shape = concat_5x, x = var_104_cast_fp16_0)[name = tensor<string, []>("op_113_cast_fp16")];
            tensor<int32, [4]> query_1_perm_0 = const()[name = tensor<string, []>("query_1_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [4]> concat_6x = const()[name = tensor<string, []>("concat_6x"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, ?, 12, 64]> var_116_cast_fp16 = reshape(shape = concat_6x, x = var_104_cast_fp16_1)[name = tensor<string, []>("op_116_cast_fp16")];
            tensor<int32, [4]> key_1_perm_0 = const()[name = tensor<string, []>("key_1_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<string, []> key_1_cast_fp16_to_fp32_dtype_0 = const()[name = tensor<string, []>("key_1_cast_fp16_to_fp32_dtype_0"), val = tensor<string, []>("fp32")];
            tensor<int32, [4]> concat_7x = const()[name = tensor<string, []>("concat_7x"), val = tensor<int32, [4]>([1, -1, 12, 64])];
            tensor<fp16, [1, ?, 12, 64]> var_119_cast_fp16 = reshape(shape = concat_7x, x = var_104_cast_fp16_2)[name = tensor<string, []>("op_119_cast_fp16")];
            tensor<int32, [4]> value_1_perm_0 = const()[name = tensor<string, []>("value_1_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<string, []> value_1_cast_fp16_to_fp32_dtype_0 = const()[name = tensor<string, []>("value_1_cast_fp16_to_fp32_dtype_0"), val = tensor<string, []>("fp32")];
            tensor<fp16, [1, 12, ?, 64]> key_1_cast_fp16 = transpose(perm = key_1_perm_0, x = var_116_cast_fp16)[name = tensor<string, []>("transpose_31")];
            tensor<int32, [4]> var_121_shape_cast_fp16 = shape(x = key_1_cast_fp16)[name = tensor<string, []>("op_121_shape_cast_fp16")];
            tensor<int32, []> gather_13_indices_0 = const()[name = tensor<string, []>("gather_13_indices_0"), val = tensor<int32, []>(2)];
            tensor<int32, []> gather_13_axis_0 = const()[name = tensor<string, []>("gather_13_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_13_batch_dims_0 = const()[name = tensor<string, []>("gather_13_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_13 = gather(axis = gather_13_axis_0, batch_dims = gather_13_batch_dims_0, indices = gather_13_indices_0, x = var_121_shape_cast_fp16)[name = tensor<string, []>("gather_13")];
            tensor<int32, []> concat_8_values0_0 = const()[name = tensor<string, []>("concat_8_values0_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> concat_8_values1_0 = const()[name = tensor<string, []>("concat_8_values1_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> concat_8_values2_0 = const()[name = tensor<string, []>("concat_8_values2_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> concat_8_axis_0 = const()[name = tensor<string, []>("concat_8_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_8_interleave_0 = const()[name = tensor<string, []>("concat_8_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> concat_8 = concat(axis = concat_8_axis_0, interleave = concat_8_interleave_0, values = (concat_8_values0_0, concat_8_values1_0, concat_8_values2_0, gather_13))[name = tensor<string, []>("concat_8")];
            tensor<int32, [4]> causal_mask_1_begin_0 = const()[name = tensor<string, []>("causal_mask_1_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<bool, [4]> causal_mask_1_end_mask_0 = const()[name = tensor<string, []>("causal_mask_1_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [?, ?, ?, ?]> causal_mask_1_cast_fp16 = slice_by_index(begin = causal_mask_1_begin_0, end = concat_8, end_mask = causal_mask_1_end_mask_0, x = attention_mask_cast_fp16)[name = tensor<string, []>("causal_mask_1_cast_fp16")];
            tensor<fp16, []> mul_2_y_0_to_fp16 = const()[name = tensor<string, []>("mul_2_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 12, ?, 64]> query_1_cast_fp16 = transpose(perm = query_1_perm_0, x = var_113_cast_fp16)[name = tensor<string, []>("transpose_30")];
            tensor<fp16, [1, 12, ?, 64]> mul_2_cast_fp16 = mul(x = query_1_cast_fp16, y = mul_2_y_0_to_fp16)[name = tensor<string, []>("mul_2_cast_fp16")];
            tensor<bool, []> matmul_1_transpose_y_0 = const()[name = tensor<string, []>("matmul_1_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_1_transpose_x_0 = const()[name = tensor<string, []>("matmul_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, ?, ?]> matmul_1_cast_fp16 = matmul(transpose_x = matmul_1_transpose_x_0, transpose_y = matmul_1_transpose_y_0, x = mul_2_cast_fp16, y = key_1_cast_fp16)[name = tensor<string, []>("matmul_1_cast_fp16")];
            tensor<fp16, [?, 12, ?, ?]> add_0_cast_fp16 = add(x = matmul_1_cast_fp16, y = causal_mask_1_cast_fp16)[name = tensor<string, []>("add_0_cast_fp16")];
            tensor<int32, []> softmax_0_axis_0 = const()[name = tensor<string, []>("softmax_0_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [?, 12, ?, ?]> softmax_0_cast_fp16 = softmax(axis = softmax_0_axis_0, x = add_0_cast_fp16)[name = tensor<string, []>("softmax_0_cast_fp16")];
            tensor<bool, []> attn_output_1_transpose_x_0 = const()[name = tensor<string, []>("attn_output_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_1_transpose_y_0 = const()[name = tensor<string, []>("attn_output_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 12, ?, 64]> value_1_cast_fp16 = transpose(perm = value_1_perm_0, x = var_119_cast_fp16)[name = tensor<string, []>("transpose_29")];
            tensor<fp16, [?, 12, ?, 64]> attn_output_1_cast_fp16 = matmul(transpose_x = attn_output_1_transpose_x_0, transpose_y = attn_output_1_transpose_y_0, x = softmax_0_cast_fp16, y = value_1_cast_fp16)[name = tensor<string, []>("attn_output_1_cast_fp16")];
            tensor<int32, [4]> var_130_perm_0 = const()[name = tensor<string, []>("op_130_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [?, ?, 12, 64]> var_130_cast_fp16 = transpose(perm = var_130_perm_0, x = attn_output_1_cast_fp16)[name = tensor<string, []>("transpose_28")];
            tensor<int32, [4]> var_132_shape_cast_fp16 = shape(x = var_130_cast_fp16)[name = tensor<string, []>("op_132_shape_cast_fp16")];
            tensor<int32, []> gather_14_indices_0 = const()[name = tensor<string, []>("gather_14_indices_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_14_axis_0 = const()[name = tensor<string, []>("gather_14_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_14_batch_dims_0 = const()[name = tensor<string, []>("gather_14_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_14 = gather(axis = gather_14_axis_0, batch_dims = gather_14_batch_dims_0, indices = gather_14_indices_0, x = var_132_shape_cast_fp16)[name = tensor<string, []>("gather_14")];
            tensor<int32, []> gather_15_indices_0 = const()[name = tensor<string, []>("gather_15_indices_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_15_axis_0 = const()[name = tensor<string, []>("gather_15_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_15_batch_dims_0 = const()[name = tensor<string, []>("gather_15_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_15 = gather(axis = gather_15_axis_0, batch_dims = gather_15_batch_dims_0, indices = gather_15_indices_0, x = var_132_shape_cast_fp16)[name = tensor<string, []>("gather_15")];
            tensor<int32, []> concat_9_axis_0 = const()[name = tensor<string, []>("concat_9_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_9_interleave_0 = const()[name = tensor<string, []>("concat_9_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [3]> concat_9 = concat(axis = concat_9_axis_0, interleave = concat_9_interleave_0, values = (gather_14, gather_15, var_23))[name = tensor<string, []>("concat_9")];
            tensor<fp16, [?, ?, 768]> var_135_cast_fp16 = reshape(shape = concat_9, x = var_130_cast_fp16)[name = tensor<string, []>("op_135_cast_fp16")];
            tensor<int32, [3]> var_139_shape_cast_fp16 = shape(x = var_135_cast_fp16)[name = tensor<string, []>("op_139_shape_cast_fp16")];
            tensor<int32, []> gather_16_indices_0 = const()[name = tensor<string, []>("gather_16_indices_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_16_axis_0 = const()[name = tensor<string, []>("gather_16_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_16_batch_dims_0 = const()[name = tensor<string, []>("gather_16_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_16 = gather(axis = gather_16_axis_0, batch_dims = gather_16_batch_dims_0, indices = gather_16_indices_0, x = var_139_shape_cast_fp16)[name = tensor<string, []>("gather_16")];
            tensor<int32, []> gather_17_indices_0 = const()[name = tensor<string, []>("gather_17_indices_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_17_axis_0 = const()[name = tensor<string, []>("gather_17_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_17_batch_dims_0 = const()[name = tensor<string, []>("gather_17_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_17 = gather(axis = gather_17_axis_0, batch_dims = gather_17_batch_dims_0, indices = gather_17_indices_0, x = var_139_shape_cast_fp16)[name = tensor<string, []>("gather_17")];
            tensor<int32, [2]> var_142 = const()[name = tensor<string, []>("op_142"), val = tensor<int32, [2]>([-1, 768])];
            tensor<fp16, [?, 768]> var_143_cast_fp16 = reshape(shape = var_142, x = var_135_cast_fp16)[name = tensor<string, []>("op_143_cast_fp16")];
            tensor<fp16, [768, 768]> transpose_1_cast_fp16_to_fp32_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [147456]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10296448))), lut = tensor<fp16, [4]>([-0x1.2acp-1, -0x1.a28p-3, 0x1.814p-8, 0x1.5ap-2]), name = tensor<string, []>("transpose_1_cast_fp16_to_fp32_to_fp16_palettized"), shape = tensor<uint32, [2]>([768, 768])];
            tensor<fp16, [768]> x_7_bias_0_to_fp16 = const()[name = tensor<string, []>("x_7_bias_0_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10443968)))];
            tensor<fp16, [?, 768]> x_7_cast_fp16 = linear(bias = x_7_bias_0_to_fp16, weight = transpose_1_cast_fp16_to_fp32_to_fp16_palettized, x = var_143_cast_fp16)[name = tensor<string, []>("x_7_cast_fp16")];
            tensor<int32, []> concat_10_axis_0 = const()[name = tensor<string, []>("concat_10_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_10_interleave_0 = const()[name = tensor<string, []>("concat_10_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [3]> concat_10 = concat(axis = concat_10_axis_0, interleave = concat_10_interleave_0, values = (gather_16, gather_17, var_6))[name = tensor<string, []>("concat_10")];
            tensor<fp16, [?, ?, 768]> input_5_cast_fp16 = reshape(shape = concat_10, x = x_7_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<fp16, [?, ?, 768]> input_7_cast_fp16 = add(x = input_5_cast_fp16, y = input_3_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<int32, [1]> x_9_axes_0 = const()[name = tensor<string, []>("x_9_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> transformer_h_0_ln_2_weight_to_fp16 = const()[name = tensor<string, []>("transformer_h_0_ln_2_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10445568)))];
            tensor<fp16, [768]> transformer_h_0_ln_2_bias_to_fp16 = const()[name = tensor<string, []>("transformer_h_0_ln_2_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10447168)))];
            tensor<fp16, [?, ?, 768]> x_9_cast_fp16 = layer_norm(axes = x_9_axes_0, beta = transformer_h_0_ln_2_bias_to_fp16, epsilon = var_5_to_fp16, gamma = transformer_h_0_ln_2_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("x_9_cast_fp16")];
            tensor<int32, [3]> var_161_shape_cast_fp16 = shape(x = x_9_cast_fp16)[name = tensor<string, []>("op_161_shape_cast_fp16")];
            tensor<int32, []> gather_19_indices_0 = const()[name = tensor<string, []>("gather_19_indices_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_19_axis_0 = const()[name = tensor<string, []>("gather_19_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_19_batch_dims_0 = const()[name = tensor<string, []>("gather_19_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_19 = gather(axis = gather_19_axis_0, batch_dims = gather_19_batch_dims_0, indices = gather_19_indices_0, x = var_161_shape_cast_fp16)[name = tensor<string, []>("gather_19")];
            tensor<int32, []> gather_20_indices_0 = const()[name = tensor<string, []>("gather_20_indices_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_20_axis_0 = const()[name = tensor<string, []>("gather_20_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_20_batch_dims_0 = const()[name = tensor<string, []>("gather_20_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_20 = gather(axis = gather_20_axis_0, batch_dims = gather_20_batch_dims_0, indices = gather_20_indices_0, x = var_161_shape_cast_fp16)[name = tensor<string, []>("gather_20")];
            tensor<int32, [2]> var_164 = const()[name = tensor<string, []>("op_164"), val = tensor<int32, [2]>([-1, 768])];
            tensor<fp16, [?, 768]> var_165_cast_fp16 = reshape(shape = var_164, x = x_9_cast_fp16)[name = tensor<string, []>("op_165_cast_fp16")];
            tensor<fp16, [3072, 768]> transpose_2_cast_fp16_to_fp32_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [589824]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10448768))), lut = tensor<fp16, [4]>([-0x1.e94p-3, -0x1.f7cp-5, 0x1.ee4p-5, 0x1.e4cp-3]), name = tensor<string, []>("transpose_2_cast_fp16_to_fp32_to_fp16_palettized"), shape = tensor<uint32, [2]>([3072, 768])];
            tensor<fp16, [3072]> x_11_bias_0_to_fp16 = const()[name = tensor<string, []>("x_11_bias_0_to_fp16"), val = tensor<fp16, [3072]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11038656)))];
            tensor<fp16, [?, 3072]> x_11_cast_fp16 = linear(bias = x_11_bias_0_to_fp16, weight = transpose_2_cast_fp16_to_fp32_to_fp16_palettized, x = var_165_cast_fp16)[name = tensor<string, []>("x_11_cast_fp16")];
            tensor<int32, []> concat_11_axis_0 = const()[name = tensor<string, []>("concat_11_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_11_interleave_0 = const()[name = tensor<string, []>("concat_11_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [3]> concat_11 = concat(axis = concat_11_axis_0, interleave = concat_11_interleave_0, values = (gather_19, gather_20, var_11))[name = tensor<string, []>("concat_11")];
            tensor<fp16, [?, ?, 3072]> input_9_cast_fp16 = reshape(shape = concat_11, x = x_11_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<string, []> x_13_mode_0 = const()[name = tensor<string, []>("x_13_mode_0"), val = tensor<string, []>("TANH_APPROXIMATION")];
            tensor<fp16, [?, ?, 3072]> x_13_cast_fp16 = gelu(mode = x_13_mode_0, x = input_9_cast_fp16)[name = tensor<string, []>("x_13_cast_fp16")];
            tensor<int32, [3]> var_183_shape_cast_fp16 = shape(x = x_13_cast_fp16)[name = tensor<string, []>("op_183_shape_cast_fp16")];
            tensor<int32, []> gather_22_indices_0 = const()[name = tensor<string, []>("gather_22_indices_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_22_axis_0 = const()[name = tensor<string, []>("gather_22_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_22_batch_dims_0 = const()[name = tensor<string, []>("gather_22_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_22 = gather(axis = gather_22_axis_0, batch_dims = gather_22_batch_dims_0, indices = gather_22_indices_0, x = var_183_shape_cast_fp16)[name = tensor<string, []>("gather_22")];
            tensor<int32, []> gather_23_indices_0 = const()[name = tensor<string, []>("gather_23_indices_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_23_axis_0 = const()[name = tensor<string, []>("gather_23_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_23_batch_dims_0 = const()[name = tensor<string, []>("gather_23_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_23 = gather(axis = gather_23_axis_0, batch_dims = gather_23_batch_dims_0, indices = gather_23_indices_0, x = var_183_shape_cast_fp16)[name = tensor<string, []>("gather_23")];
            tensor<int32, [2]> var_186 = const()[name = tensor<string, []>("op_186"), val = tensor<int32, [2]>([-1, 3072])];
            tensor<fp16, [?, 3072]> var_187_cast_fp16 = reshape(shape = var_186, x = x_13_cast_fp16)[name = tensor<string, []>("op_187_cast_fp16")];
            tensor<fp16, [768, 3072]> transpose_3_cast_fp16_to_fp32_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [589824]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11044864))), lut = tensor<fp16, [4]>([-0x1.13cp-3, -0x1.388p-5, 0x1.35p-5, 0x1.13p-3]), name = tensor<string, []>("transpose_3_cast_fp16_to_fp32_to_fp16_palettized"), shape = tensor<uint32, [2]>([768, 3072])];
            tensor<fp16, [768]> x_15_bias_0_to_fp16 = const()[name = tensor<string, []>("x_15_bias_0_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11634752)))];
            tensor<fp16, [?, 768]> x_15_cast_fp16 = linear(bias = x_15_bias_0_to_fp16, weight = transpose_3_cast_fp16_to_fp32_to_fp16_palettized, x = var_187_cast_fp16)[name = tensor<string, []>("x_15_cast_fp16")];
            tensor<int32, []> concat_12_axis_0 = const()[name = tensor<string, []>("concat_12_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_12_interleave_0 = const()[name = tensor<string, []>("concat_12_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [3]> concat_12 = concat(axis = concat_12_axis_0, interleave = concat_12_interleave_0, values = (gather_22, gather_23, var_6))[name = tensor<string, []>("concat_12")];
            tensor<fp16, [?, ?, 768]> input_11_cast_fp16 = reshape(shape = concat_12, x = x_15_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<fp16, [?, ?, 768]> input_13_cast_fp16 = add(x = input_7_cast_fp16, y = input_11_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<int32, [1]> x_17_axes_0 = const()[name = tensor<string, []>("x_17_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [768]> transformer_h_1_ln_1_weight_to_fp16 = const()[name = tensor<string, []>("transformer_h_1_ln_1_weight_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11636352)))];
            tensor<fp16, [768]> transformer_h_1_ln_1_bias_to_fp16 = const()[name = tensor<string, []>("transformer_h_1_ln_1_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11637952)))];
            tensor<fp16, [?, ?, 768]> x_17_cast_fp16 = layer_norm(axes = x_17_axes_0, beta = transformer_h_1_ln_1_bias_to_fp16, epsilon = var_5_to_fp16, gamma = transformer_h_1_ln_1_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("x_17_cast_fp16")];
            tensor<int32, [3]> var_209_shape_cast_fp16 = shape(x = x_17_cast_fp16)[name = tensor<string, []>("op_209_shape_cast_fp16")];
            tensor<int32, []> gather_25_indices_0 = const()[name = tensor<string, []>("gather_25_indices_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_25_axis_0 = const()[name = tensor<string, []>("gather_25_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_25_batch_dims_0 = const()[name = tensor<string, []>("gather_25_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_25 = gather(axis = gather_25_axis_0, batch_dims = gather_25_batch_dims_0, indices = gather_25_indices_0, x = var_209_shape_cast_fp16)[name = tensor<string, []>("gather_25")];
            tensor<int32, []> gather_26_indices_0 = const()[name = tensor<string, []>("gather_26_indices_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_26_axis_0 = const()[name = tensor<string, []>("gather_26_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_26_batch_dims_0 = const()[name = tensor<string, []>("gather_26_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_26 = gather(axis = gather_26_axis_0, batch_dims = gather_26_batch_dims_0, indices = gather_26_indices_0, x = var_209_shape_cast_fp16)[name = tensor<string, []>("gather_26")];
            tensor<int32, [2]> var_212 = const()[name = tensor<string, []>("op_212"), val = tensor<int32, [2]>([-1, 768])];
            tensor<fp16, [?, 768]> var_213_cast_fp16 = reshape(shape = var_212, x = x_17_cast_fp16)[name = tensor<string, []>("op_213_cast_fp16")];
            tensor<fp16, [2304, 768]> transpose_4_cast_fp16_to_fp32_to_fp16_palettized = constexpr_lut_to_dense()[indices = tensor<uint8, [442368]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11639552))), lut = tensor<fp16, [4]>([-0x1.05p-2, -0x1.f0cp-5, 0x1.f9p-5, 0x1.07p-2]), name = tensor<string, []>("transpose_4_cast_fp16_to_fp32_to_fp16_palettized"), shape = tensor<uint32, [2]>([2304, 768])];
            tensor<fp16, [2304]> x_19_bias_0_to_fp16 = const()[name = tensor<string, []>("x_19_bias_0_to_fp16"), val = tensor<fp16, [2304]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12081984)))];
            tensor<fp16, [?, 2304]> x_19_cast_fp16 = linear(bias = x_19_bias_0_to_fp16, weight = transpose_4_cast_fp16_to_fp32_to_fp16_palettized, x = var_213_cast_fp16)[name = tensor<string, []>("x_19_cast_fp16")];
            tensor<int32, []> concat_13_axis_0 = const()[name = tensor<string, []>("concat_13_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_13_interleave_0 = const()[name = tensor<string, []>("concat_13_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [3]> concat_13 = concat(axis = concat_13_axis_0, interleave = concat_13_interleave_0, values = (gather_25, gather_26, var_9))[name = tensor<string, []>("concat_13")];
            tensor<fp16, [?, ?, 2304]> var_216_cast_fp16 = reshape(shape = concat_13, x = x_19_cast_fp16)[name = tensor<string, []>("op_216_cast_fp16")];
            tensor<int32, [3]> tile_1 = const()[name = tensor<string, []>("tile_1"), val = tensor<int32, [3]>([768, 768, 768])];
            tensor<int32, []> var_217_axis_0 = const()[name = tensor<string, []>("op_217_axis_0"), val = tensor<int32, []>(2)];
            tensor<fp16, [?, ?, 768]> var_217_cast_fp16_0, tensor<fp16, [?, ?, 768]> var_217_cast_fp16_1, tensor<fp16, [?, ?, 768]> var_217_cast_fp16_2 = split(axis = var_217_axis_0, split_sizes = tile_1, x = var_216_cast_fp16)[name = tensor<string, []>("op_217_cast_fp16")];
            tensor<int32, [3]> var_221_shape_cast_fp16 = shape(x = var_217_cast_fp16_0)[name = tensor<string, []>("op_221_shape_cast_fp16")];
            tensor<int32, []> gather_29_indices_0 = const()[name = tensor<string, []>("gather_29_indices_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_29_axis_0 = const()[name = tensor<string, []>("gather_29_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_29_batch_dims_0 = const()[name = tensor<string, []>("gather_29_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_29 = gather(axis = gather_29_axis_0, batch_dims = gather_29_batch_dims_0, indices = gather_29_indices_0, x = var_221_shape_cast_fp16)[name = tensor<string, []>("gather_29")];
            tensor<int32, []> gather_30_indices_0 = const()[name = tensor<string, []>("gather_30_indices_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_30_axis_0 = const()[name = tensor<string, []>("gather_30_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_30_batch_dims_0 = const()[name = tensor<string, []>("gather_30_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_30 = gather(axis = gather_30_axis_0, batch_dims = gather_30_batch_dims_0, indices = gather_30_indices_0, x = var_221_shape_cast_fp16)[name = tensor<string, []>("gather_30")];
            tensor<int32, [3]> var_223_shape_cast_fp16 = shape(x = var_217_cast_fp16_1)[name = tensor<string, []>("op_223_shape_cast_fp16")];
            tensor<int32, []> gather_31_indices_0 = const()[name = tensor<string, []>("gather_31_indices_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_31_axis_0 = const()[name = tensor<string, []>("gather_31_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_31_batch_dims_0 = const()[name = tensor<string, []>("gather_31_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_31 = gather(axis = gather_31_axis_0, batch_dims = gather_31_batch_dims_0, indices = gather_31_indices_0, x = var_223_shape_cast_fp16)[name = tensor<string, []>("gather_31")];
            tensor<int32, [3]> var_224_shape_cast_fp16 = shape(x = var_217_cast_fp16_1)[name = tensor<string, []>("op_224_shape_cast_fp16")];
            tensor<int32, []> gather_32_indices_0 = const()[name = tensor<string, []>("gather_32_indices_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_32_axis_0 = const()[name = tensor<string, []>("gather_32_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_32_batch_dims_0 = const()[name = tensor<string, []>("gather_32_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_32 = gather(axis = gather_32_axis_0, batch_dims = gather_32_batch_dims_0, indices = gather_32_indices_0, x = var_224_shape_cast_fp16)[name = tensor<string, []>("gather_32")];
            tensor<int32, []> concat_14_axis_0 = const()[name = tensor<string, []>("concat_14_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_14_interleave_0 = const()[name = tensor<string, []>("concat_14_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> concat_14 = concat(axis = concat_14_axis_0, interleave = concat_14_interleave_0, values = (gather_29, gather_30, var_23, var_8))[name = tensor<string, []>("concat_14")];
            tensor<fp16, [?, ?, 12, 64]> var_226_cast_fp16 = reshape(shape = concat_14, x = var_217_cast_fp16_0)[name = tensor<string, []>("op_226_cast_fp16")];
            tensor<int32, [4]> query_5_perm_0 = const()[name = tensor<string, []>("query_5_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, []> concat_15_axis_0 = const()[name = tensor<string, []>("concat_15_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_15_interleave_0 = const()[name = tensor<string, []>("concat_15_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> concat_15 = concat(axis = concat_15_axis_0, interleave = concat_15_interleave_0, values = (gather_31, gather_32, var_23, var_8))[name = tensor<string, []>("concat_15")];
            tensor<fp16, [?, ?, 12, 64]> var_229_cast_fp16 = reshape(shape = concat_15, x = var_217_cast_fp16_1)[name = tensor<string, []>("op_229_cast_fp16")];
            tensor<int32, [4]> key_5_perm_0 = const()[name = tensor<string, []>("key_5_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<string, []> key_5_cast_fp16_to_fp32_dtype_0 = const()[name = tensor<string, []>("key_5_cast_fp16_to_fp32_dtype_0"), val = tensor<string, []>("fp32")];
            tensor<fp16, [?, ?, 12, 64]> var_232_cast_fp16 = reshape(shape = concat_15, x = var_217_cast_fp16_2)[name = tensor<string, []>("op_232_cast_fp16")];
            tensor<int32, [4]> value_5_perm_0 = const()[name = tensor<string, []>("value_5_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<string, []> value_5_cast_fp16_to_fp32_dtype_0 = const()[name = tensor<string, []>("value_5_cast_fp16_to_fp32_dtype_0"), val = tensor<string, []>("fp32")];
            tensor<fp16, [?, 12, ?, 64]> key_5_cast_fp16 = transpose(perm = key_5_perm_0, x = var_229_cast_fp16)[name = tensor<string, []>("transpose_27")];
            tensor<int32, [4]> var_234_shape_cast_fp16 = shape(x = key_5_cast_fp16)[name = tensor<string, []>("op_234_shape_cast_fp16")];
            tensor<int32, []> gather_33_indices_0 = const()[name = tensor<string, []>("gather_33_indices_0"), val = tensor<int32, []>(2)];
            tensor<int32, []> gather_33_axis_0 = const()[name = tensor<string, []>("gather_33_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_33_batch_dims_0 = const()[name = tensor<string, []>("gather_33_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_33 = gather(axis = gather_33_axis_0, batch_dims = gather_33_batch_dims_0, indices = gather_33_indices_0, x = var_234_shape_cast_fp16)[name = tensor<string, []>("gather_33")];
            tensor<int32, []> concat_17_values0_0 = const()[name = tensor<string, []>("concat_17_values0_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> concat_17_values1_0 = const()[name = tensor<string, []>("concat_17_values1_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> concat_17_values2_0 = const()[name = tensor<string, []>("concat_17_values2_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> concat_17_axis_0 = const()[name = tensor<string, []>("concat_17_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_17_interleave_0 = const()[name = tensor<string, []>("concat_17_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> concat_17 = concat(axis = concat_17_axis_0, interleave = concat_17_interleave_0, values = (concat_17_values0_0, concat_17_values1_0, concat_17_values2_0, gather_33))[name = tensor<string, []>("concat_17")];
            tensor<int32, [4]> causal_mask_3_begin_0 = const()[name = tensor<string, []>("causal_mask_3_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<bool, [4]> causal_mask_3_end_mask_0 = const()[name = tensor<string, []>("causal_mask_3_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [?, ?, ?, ?]> causal_mask_3_cast_fp16 = slice_by_index(begin = causal_mask_3_begin_0, end = concat_17, end_mask = causal_mask_3_end_mask_0, x = attention_mask_cast_fp16)[name = tensor<string, []>("causal_mask_3_cast_fp16")];
            tensor<fp16, []> mul_5_y_0_to_fp16 = const()[name = tensor<string, []>("mul_5_y_0_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [?, 12, ?, 64]> query_5_cast_fp16 = transpose(perm = query_5_perm_0, x = var_226_cast_fp16)[name = tensor<string, []>("transpose_26")];
            tensor<fp16, [?, 12, ?, 64]> mul_5_cast_fp16 = mul(x = query_5_cast_fp16, y = mul_5_y_0_to_fp16)[name = tensor<string, []>("mul_5_cast_fp16")];
            tensor<bool, []> matmul_6_transpose_y_0 = const()[name = tensor<string, []>("matmul_6_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_6_transpose_x_0 = const()[name = tensor<string, []>("matmul_6_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [?, 12, ?, ?]> matmul_6_cast_fp16 = matmul(transpose_x = matmul_6_transpose_x_0, transpose_y = matmul_6_transpose_y_0, x = mul_5_cast_fp16, y = key_5_cast_fp16)[name = tensor<string, []>("matmul_6_cast_fp16")];
            tensor<fp16, [?, 12, ?, ?]> add_1_cast_fp16 = add(x = matmul_6_cast_fp16, y = causal_mask_3_cast_fp16)[name = tensor<string, []>("add_1_cast_fp16")];
            tensor<int32, []> softmax_1_axis_0 = const()[name = tensor<string, []>("softmax_1_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [?, 12, ?, ?]> softmax_1_cast_fp16 = softmax(axis = softmax_1_axis_0, x = add_1_cast_fp16)[name = tensor<string, []>("softmax_1_cast_fp16")];
            tensor<bool, []> attn_output_7_transpose_x_0 = const()[name = tensor<string, []>("attn_output_7_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_7_transpose_y_0 = const()[name = tensor<string, []>("attn_output_7_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [?, 12, ?, 64]> value_5_cast_fp16 = transpose(perm = value_5_perm_0, x = var_232_cast_fp16)[name = tensor<string, []>("transpose_25")];
            tensor<fp16, [?, 12, ?, 64]> attn_output_7_cast_fp16 = matmul(transpose_x = attn_output_7_transpose_x_0, transpose_y = attn_output_7_transpose_y_0, x = softmax_1_cast_fp16, y = value_5_cast_fp16)[name = tensor<string, []>("attn_output_7_cast_fp16")];
            tensor<int32, [4]> var_243_perm_0 = const()[name = tensor<string, []>("op_243_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [?, ?, 12, 64]> var_243_cast_fp16 = transpose(perm = var_243_perm_0, x = attn_output_7_cast_fp16)[name = tensor<string, []>("transpose_24")];
            tensor<int32, [4]> var_245_shape_cast_fp16 = shape(x = var_243_cast_fp16)[name = tensor<string, []>("op_245_shape_cast_fp16")];
            tensor<int32, []> gather_34_indices_0 = const()[name = tensor<string, []>("gather_34_indices_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_34_axis_0 = const()[name = tensor<string, []>("gather_34_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_34_batch_dims_0 = const()[name = tensor<string, []>("gather_34_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_34 = gather(axis = gather_34_axis_0, batch_dims = gather_34_batch_dims_0, indices = gather_34_indices_0, x = var_245_shape_cast_fp16)[name = tensor<string, []>("gather_34")];
            tensor<int32, []> gather_35_indices_0 = const()[name = tensor<string, []>("gather_35_indices_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> gather_35_axis_0 = const()[name = tensor<string, []>("gather_35_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_35_batch_dims_0 = const()[name = tensor<string, []>("gather_35_batch_dims_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_35 = gather(axis = gather_35_axis_0, batch_dims = gather_35_batch_dims_0, indices = gather_35_indices_0, x = var_245_shape_cast_fp16)[name = tensor<string, []>("gather_35")];
            tensor<int32, []> concat_18_axis_0 = const()[name = tensor<string, []>("concat_18_axis_0"), val = tensor<int32, []>(0)];
            tensor<bool, []> concat_18_interleave_0 = const()[name = tensor<string, []>("concat_18_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, [3]> concat_18 = concat(axis = concat_18_axis_0, interleave = concat_18_interleave_0, values = (gather_34, gather_35, var_23))[name = tensor<string, []>("concat_18")];
            tensor<fp16, [?, ?, 768]> var_248_cast_fp16 = reshape(shape = concat_18, x = var_243_cast_fp16)[name = tensor<string, []>("op_248_cast_fp16")];
            tensor<int32, [3]> var_252_shape_cast_fp16 = shape(x = var_248_cast_fp16)[name = tensor<string, []>("op_252_shape_cast_fp16")];
            tensor<int32, []> gather_36_indices_0 = const()[name = tensor<string, []>("gather_36_indices_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_36_axis_0 = const()[name = tensor<string, []>("gather_36_axis_0"), val = tensor<int32, []>(0)];
            tensor<int32, []> gather_36_batch_dims_0 = const()[name = tensor<string, []>("gather_36_batch_dims_0"), val = tensor<int32, []>(0)];
